_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 64)                3496384   
_________________________________________________________________
dense_2 (Dense)              (None, 50)                3250      
_________________________________________________________________
dense_3 (Dense)              (None, 50)                2550      
_________________________________________________________________
dense_4 (Dense)              (None, 50)                2550      
_________________________________________________________________
dense_5 (Dense)              (None, 50)                2550      
_________________________________________________________________
dense_6 (Dense)              (None, 50)                2550      
_________________________________________________________________
dense_7 (Dense)              (None, 6)                 306       
=================================================================
Total params: 3,510,140
Trainable params: 3,510,140
Non-trainable params: 0
_________________________________________________________________
[[  0   0   0   0  11 243]
 [  0   0   0   0 164   8]
 [  0   0   0   0   0 158]
 [  0   0   0   0  21   0]
 [  0   0   0   0  68   0]
 [  0   0   0   0  19   0]]

 Precision : 0.04004711425206125
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_8 (Dense)              (None, 64)                3496384   
_________________________________________________________________
dense_9 (Dense)              (None, 100)               6500      
_________________________________________________________________
dense_10 (Dense)             (None, 100)               10100     
_________________________________________________________________
dense_11 (Dense)             (None, 100)               10100     
_________________________________________________________________
dense_12 (Dense)             (None, 100)               10100     
_________________________________________________________________
dense_13 (Dense)             (None, 100)               10100     
_________________________________________________________________
dense_14 (Dense)             (None, 6)                 606       
=================================================================
Total params: 3,543,890
Trainable params: 3,543,890
Non-trainable params: 0
_________________________________________________________________
[[250   3   0   0   1   0]
 [  2 164   0   1   5   0]
 [  0   1 157   0   0   0]
 [  0   0   0  20   1   0]
 [  0   2   0   0  62   4]
 [  1   0   0   0   9   9]]

 Precision : 0.8987347690672499
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_22 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_23 (Dense)             (None, 50)                3250      
_________________________________________________________________
dropout_1 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_24 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_2 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_3 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_26 (Dense)             (None, 6)                 306       
=================================================================
Total params: 3,505,040
Trainable params: 3,505,040
Non-trainable params: 0
_________________________________________________________________
[[252   1   0   0   1   0]
 [  3 161   0   0   8   0]
 [  0   0 157   0   1   0]
 [  0   0   0  19   1   1]
 [  0   1   0   0  56  11]
 [  0   0   0   0   5  14]]

 Precision : 0.8820341119511094
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_27 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_28 (Dense)             (None, 100)               6500      
_________________________________________________________________
dropout_4 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_29 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_5 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_30 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_6 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_31 (Dense)             (None, 6)                 606       
=================================================================
Total params: 3,523,690
Trainable params: 3,523,690
Non-trainable params: 0
_________________________________________________________________
[[249   3   0   0   2   0]
 [  1 163   0   1   7   0]
 [  0   1 157   0   0   0]
 [  0   0   0  20   1   0]
 [  0   2   0   0  63   3]
 [  0   0   0   0  10   9]]

 Precision : 0.9036523563965639
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_32 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_33 (Dense)             (None, 1000)              65000     
_________________________________________________________________
dropout_7 (Dropout)          (None, 1000)              0         
_________________________________________________________________
dense_34 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_8 (Dropout)          (None, 1000)              0         
_________________________________________________________________
dense_35 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_9 (Dropout)          (None, 1000)              0         
_________________________________________________________________
dense_36 (Dense)             (None, 6)                 6006      
=================================================================
Total params: 5,569,390
Trainable params: 5,569,390
Non-trainable params: 0
_________________________________________________________________
[[250   3   0   0   1   0]
 [  2 162   0   1   7   0]
 [  0   1 157   0   0   0]
 [  0   0   0  20   1   0]
 [  0   1   0   0  64   3]
 [  1   0   0   0   8  10]]

 Precision : 0.9116562251885808
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_37 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_38 (Dense)             (None, 1500)              97500     
_________________________________________________________________
dropout_10 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_39 (Dense)             (None, 1500)              2251500   
_________________________________________________________________
dropout_11 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_40 (Dense)             (None, 1500)              2251500   
_________________________________________________________________
dropout_12 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_41 (Dense)             (None, 6)                 9006      
=================================================================
Total params: 8,105,890
Trainable params: 8,105,890
Non-trainable params: 0
_________________________________________________________________
[[250   3   0   0   1   0]
 [  2 162   0   1   7   0]
 [  0   1 157   0   0   0]
 [  0   0   0  20   1   0]
 [  0   2   0   0  63   3]
 [  0   0   0   0  11   8]]

 Precision : 0.8991731717635333
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_42 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_43 (Dense)             (None, 2000)              130000    
_________________________________________________________________
dropout_13 (Dropout)         (None, 2000)              0         
_________________________________________________________________
dense_44 (Dense)             (None, 2000)              4002000   
_________________________________________________________________
dropout_14 (Dropout)         (None, 2000)              0         
_________________________________________________________________
dense_45 (Dense)             (None, 2000)              4002000   
_________________________________________________________________
dropout_15 (Dropout)         (None, 2000)              0         
_________________________________________________________________
dense_46 (Dense)             (None, 6)                 12006     
=================================================================
Total params: 11,642,390
Trainable params: 11,642,390
Non-trainable params: 0
_________________________________________________________________
[[250   3   0   0   1   0]
 [  3 165   0   1   3   0]
 [  0   1 157   0   0   0]
 [  0   1   0  20   0   0]
 [  0   1   0   0  63   4]
 [  1   0   0   0   9   9]]

 Precision : 0.9038000437192314
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_47 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_48 (Dense)             (None, 50)                3250      
_________________________________________________________________
dropout_16 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_49 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_17 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_50 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_18 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_51 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_19 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_52 (Dense)             (None, 6)                 306       
=================================================================
Total params: 3,507,590
Trainable params: 3,507,590
Non-trainable params: 0
_________________________________________________________________
[[254   0   0   0   0   0]
 [172   0   0   0   0   0]
 [158   0   0   0   0   0]
 [ 21   0   0   0   0   0]
 [ 68   0   0   0   0   0]
 [ 19   0   0   0   0   0]]

 Precision : 0.06117533718689788
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_53 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_54 (Dense)             (None, 100)               6500      
_________________________________________________________________
dropout_20 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_55 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_21 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_56 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_22 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_57 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_23 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_58 (Dense)             (None, 6)                 606       
=================================================================
Total params: 3,533,790
Trainable params: 3,533,790
Non-trainable params: 0
_________________________________________________________________
[[252   1   0   0   1   0]
 [  4 163   0   0   5   0]
 [  1   0 157   0   0   0]
 [  0   0   0  17   2   2]
 [  0   5   0   0  61   2]
 [  1   0   0   0  11   7]]

 Precision : 0.8900174773050445
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_59 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_60 (Dense)             (None, 1000)              65000     
_________________________________________________________________
dropout_24 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_61 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_25 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_62 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_26 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_63 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_27 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_64 (Dense)             (None, 6)                 6006      
=================================================================
Total params: 6,570,390
Trainable params: 6,570,390
Non-trainable params: 0
_________________________________________________________________
[[252   1   0   0   1   0]
 [  4 164   0   1   3   0]
 [  0   1 157   0   0   0]
 [  0   1   0  20   0   0]
 [  0   4   0   0  61   3]
 [  1   0   0   0   9   9]]

 Precision : 0.9110523918787282
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_65 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_66 (Dense)             (None, 1500)              97500     
_________________________________________________________________
dropout_28 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_67 (Dense)             (None, 1500)              2251500   
_________________________________________________________________
dropout_29 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_68 (Dense)             (None, 1500)              2251500   
_________________________________________________________________
dropout_30 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_69 (Dense)             (None, 1500)              2251500   
_________________________________________________________________
dropout_31 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_70 (Dense)             (None, 6)                 9006      
=================================================================
Total params: 10,357,390
Trainable params: 10,357,390
Non-trainable params: 0
_________________________________________________________________
[[250   3   0   0   1   0]
 [  3 163   0   1   5   0]
 [  0   1 157   0   0   0]
 [  0   0   0  20   1   0]
 [  0   2   0   0  62   4]
 [  1   0   0   0   9   9]]

 Precision : 0.8980515749140826
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_71 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_72 (Dense)             (None, 2000)              130000    
_________________________________________________________________
dropout_32 (Dropout)         (None, 2000)              0         
_________________________________________________________________
dense_73 (Dense)             (None, 2000)              4002000   
_________________________________________________________________
dropout_33 (Dropout)         (None, 2000)              0         
_________________________________________________________________
dense_74 (Dense)             (None, 2000)              4002000   
_________________________________________________________________
dropout_34 (Dropout)         (None, 2000)              0         
_________________________________________________________________
dense_75 (Dense)             (None, 2000)              4002000   
_________________________________________________________________
dropout_35 (Dropout)         (None, 2000)              0         
_________________________________________________________________
dense_76 (Dense)             (None, 6)                 12006     
=================================================================
Total params: 15,644,390
Trainable params: 15,644,390
Non-trainable params: 0
_________________________________________________________________
[[250   3   0   0   1   0]
 [  3 162   0   1   6   0]
 [  0   1 157   0   0   0]
 [  0   0   0  20   1   0]
 [  0   1   0   0  64   3]
 [  1   0   0   0  10   8]]

 Precision : 0.9024088888791977
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_77 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_78 (Dense)             (None, 50)                3250      
_________________________________________________________________
dropout_36 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_79 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_37 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_80 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_38 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_81 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_39 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_82 (Dense)             (None, 50)                2550      
_________________________________________________________________
dropout_40 (Dropout)         (None, 50)                0         
_________________________________________________________________
dense_83 (Dense)             (None, 6)                 306       
=================================================================
Total params: 3,510,140
Trainable params: 3,510,140
Non-trainable params: 0
_________________________________________________________________
[[  0   0   0   0 254   0]
 [  0   0   0   0 172   0]
 [  0   0   0   0 158   0]
 [  0   0   0   0  21   0]
 [  0   0   0   0  68   0]
 [  0   0   0   0  19   0]]

 Precision : 0.016377649325626204
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_84 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_85 (Dense)             (None, 100)               6500      
_________________________________________________________________
dropout_41 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_86 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_42 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_87 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_43 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_88 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_44 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_89 (Dense)             (None, 100)               10100     
_________________________________________________________________
dropout_45 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_90 (Dense)             (None, 6)                 606       
=================================================================
Total params: 3,543,890
Trainable params: 3,543,890
Non-trainable params: 0
_________________________________________________________________
[[251   2   0   0   1   0]
 [  3 161   0   0   8   0]
 [  1   0 157   0   0   0]
 [  0   0   0  20   0   1]
 [  0   1   0   0  52  15]
 [  0   0   0   0   6  13]]

 Precision : 0.8650693846029012
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_91 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_92 (Dense)             (None, 1000)              65000     
_________________________________________________________________
dropout_46 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_93 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_47 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_94 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_48 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_95 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_49 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_96 (Dense)             (None, 1000)              1001000   
_________________________________________________________________
dropout_50 (Dropout)         (None, 1000)              0         
_________________________________________________________________
dense_97 (Dense)             (None, 6)                 6006      
=================================================================
Total params: 7,571,390
Trainable params: 7,571,390
Non-trainable params: 0
_________________________________________________________________
[[250   3   0   0   1   0]
 [  2 163   0   1   6   0]
 [  0   1 157   0   0   0]
 [  0   0   0  20   1   0]
 [  0   2   0   0  63   3]
 [  1   0   0   0   9   9]]

 Precision : 0.9070867143818648
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_98 (Dense)             (None, 64)                3496384   
_________________________________________________________________
dense_99 (Dense)             (None, 1500)              97500     
_________________________________________________________________
dropout_51 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_100 (Dense)            (None, 1500)              2251500   
_________________________________________________________________
dropout_52 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_101 (Dense)            (None, 1500)              2251500   
_________________________________________________________________
dropout_53 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_102 (Dense)            (None, 1500)              2251500   
_________________________________________________________________
dropout_54 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_103 (Dense)            (None, 1500)              2251500   
_________________________________________________________________
dropout_55 (Dropout)         (None, 1500)              0         
_________________________________________________________________
dense_104 (Dense)            (None, 6)                 9006      
=================================================================
Total params: 12,608,890
Trainable params: 12,608,890
Non-trainable params: 0
_________________________________________________________________
[[250   3   0   0   1   0]
 [  2 164   0   1   5   0]
 [  0   1 157   0   0   0]
 [  0   0   0  21   0   0]
 [  0   3   0   0  62   3]
 [  1   0   0   0  10   8]]

 Precision : 0.9039827661109126
